/**
 * @module ZerOS.Hardware.Nas.NasKind
 * @description ZNP1 节点种类
 *
 * ---------------------------------------------------------------------------
 * 文件职责
 * ---------------------------------------------------------------------------
 * 查看成功时，返回字第 1 个八位组。只有文件和目录。
 *
 * ---------------------------------------------------------------------------
 * 代码组织（严格优先级，自上而下，禁止打乱）
 * ---------------------------------------------------------------------------
 *   1. 种类
 */

export namespace ZerOS {
  export namespace Hardware {
    export namespace Nas {
      /** 普通文件。 */
      export const NasKindFile = 1;

      /** 目录。 */
      export const NasKindDirectory = 2;
    }
  }
}
